InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТоварУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Бронь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Бронь</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Бронирование</xr:Item>
				<xr:Item>AccumulationRegister.Выручка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоБрони</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецБрони</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/Служебный/Ext/Module.bsl
Функция ПолучитьЗаголовок() Экспорт
	Возврат Константы.НаименованиеКлуба.Получить()
КонецФункции    

Функция ПолучитьИмя() Экспорт
	Возврат Константы.ГенеральныйДиректор.Получить()
КонецФункции    


Функция ПолучитьЦену(ТоварУслуга, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&Дата, ТоварУслуга = &ТоварУслуга) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТоварУслуга", ТоварУслуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
	КонецЦикла;   
	
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Цена) Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;     
	Иначе
		Возврат 0;    
	КонецЕсли;

	
КонецФункции // ПолучитьЦену()

&НаСервере
Процедура Правила(ТабДок, СсылкаНаДокумент)  Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бронь.Номер КАК Номер,
		|	Бронь.Дата КАК Дата
		|ИЗ
		|	Документ.Бронь КАК Бронь
		|ГДЕ
		|	Бронь.Ссылка = &СсылкаНаДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Бронь.Клиент КАК Клиент,
		|	Бронь.Компьютер КАК Компьютер,
		|	Бронь.НачалоБрони КАК НачалоБрони,
		|	Бронь.КонецБрони КАК КонецБрони,
		|	Бронь.Сумма КАК Сумма
		|ИЗ
		|	Документ.Бронь КАК Бронь
		|ГДЕ
		|	Бронь.Ссылка = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);    
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеЗаголовок = МассивРезультатовЗапроса[0];
	ДанныеШапка = МассивРезультатовЗапроса[1];

	
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;             
	
	ВыборкаЗаголовок = ДанныеЗаголовок.Выбрать();
	ВыборкаЗаголовок.Следующий();
	
	ВыборкаШапка = ДанныеШапка.Выбрать();
	ВыборкаШапка.Следующий(); 
	
	НазваниеКлуба = Константы.НаименованиеКлуба.Получить();
	                                    
	
	
	Макет = Документы.Бронь.ПолучитьМакет("СогласияСПравилами"); 
	
	ОбластьНазвание = Макет.ПолучитьОбласть("Название"); 
	ОбластьНазвание.Параметры.НазваниеКлуб = НазваниеКлуба;
	ТабДок.Вывести(ОбластьНазвание);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");      
	ОбластьЗаголовок.Параметры.Номер = ВыборкаЗаголовок.Номер; 
	ОбластьЗаголовок.Параметры.Дата = Формат(ВыборкаЗаголовок.Дата, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьЗаголовок);

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Клиент = ВыборкаШапка.Клиент; 
	ОбластьШапка.Параметры.Компьютер = ВыборкаШапка.Компьютер;
	ОбластьШапка.Параметры.НачалоБрони = ВыборкаШапка.НачалоБрони; 
	ОбластьШапка.Параметры.КонецБрони = ВыборкаШапка.КонецБрони; 
	ОбластьШапка.Параметры.Сумма = ВыборкаШапка.Сумма;
	ТабДок.Вывести(ОбластьШапка);

	ОбластьПолныеПравила = Макет.ПолучитьОбласть("ПолныеПравила");	
	ТабДок.Вывести(ОбластьПолныеПравила);

    ОбластьПравила = Макет.ПолучитьОбласть("Правила");   
	ТабДок.Вывести(ОбластьПравила);

	ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");  
	ТабДок.Вывести(ОбластьПодпись);

	
КонецПроцедуры
